In [3]:
import pandas as pd
import numpy as np
pd.__version__

'2.3.3'

In [3]:
s = pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [4]:
df=pd.DataFrame({
    "name":["ajay","satish"],
    "age":[20,21]
})
df

     name  age
0    ajay   20
1  satish   21

# Reading Data

In [8]:
df= pd.read_csv('weather_data.csv')
df

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  Hyderabad             28          60     Sunny
1  02-01-2025  Hyderabad             29          62    Cloudy
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy
5  06-01-2025  Hyderabad             33          59     Rainy
6  07-01-2025   Banglore             34          54     Sunny

# Writing data into files

In [14]:
df.to_csv('data.csv',index=False)

# Exploring Data

In [15]:
df.head()

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  Hyderabad             28          60     Sunny
1  02-01-2025  Hyderabad             29          62    Cloudy
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy

In [16]:
df.tail()

         Date       city  Temperature_c  Humidity_% Condition
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy
5  06-01-2025  Hyderabad             33          59     Rainy
6  07-01-2025   Banglore             34          54     Sunny

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           7 non-null      object
 1   city           7 non-null      object
 2   Temperature_c  7 non-null      int64
 3   Humidity_%     7 non-null      int64
 4   Condition      7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [18]:
df['Date'][df['Condition']=='Rainy']

2    03-01-2025
5    06-01-2025
Name: Date, dtype: object

In [19]:
df.shape

(7, 5)

In [20]:
df[2:5]

         Date       city  Temperature_c  Humidity_% Condition
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy

In [21]:
df.columns

Index(['Date', 'city', 'Temperature_c', 'Humidity_%', 'Condition'], dtype='object')

In [22]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [23]:
df.dtypes

Date             object
city             object
Temperature_c     int64
Humidity_%        int64
Condition        object
dtype: object

In [24]:
df.Date

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
Name: Date, dtype: object

In [25]:
df['Date']

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
Name: Date, dtype: object

In [26]:
df[['Date','Condition']]

         Date Condition
0  01-01-2025     Sunny
1  02-01-2025    Cloudy
2  03-01-2025     Rainy
3  04-01-2025     Sunny
4  05-01-2025    Cloudy
5  06-01-2025     Rainy
6  07-01-2025     Sunny

# Missing Values

In [27]:
df.isnull()

    Date   city  Temperature_c  Humidity_%  Condition
0  False  False          False       False      False
1  False  False          False       False      False
2  False  False          False       False      False
3  False  False          False       False      False
4  False  False          False       False      False
5  False  False          False       False      False
6  False  False          False       False      False

In [37]:
df=pd.DataFrame({
    "name":["ajay","satish","deeven"],
    "age":[20,21,None]
})
df

     name   age
0    ajay  20.0
1  satish  21.0
2  deeven   NaN

In [30]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False   True

In [32]:
df.isnull().sum()   #total missing values

name    0
age     1
dtype: int64

In [33]:
df[df.isnull().any(axis=1)]     #show rows with missing values

     name  age
2  deeven  NaN

In [34]:
df['age']=df['age'].fillna(df['age'].mean())

In [35]:
df

     name   age
0    ajay  20.0
1  satish  21.0
2  deeven  20.5

In [38]:
df_clean=df.dropna()
df_clean

     name   age
0    ajay  20.0
1  satish  21.0

# Duplicates

In [3]:
df=pd.DataFrame({
    "name":["ajay","satish","ajay"],
    "age":[20,21,20]
})
df

     name  age
0    ajay   20
1  satish   21
2    ajay   20

In [4]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [5]:
df[df.duplicated()]

   name  age
2  ajay   20

In [6]:
df=df.drop_duplicates()
df

     name  age
0    ajay   20
1  satish   21

# Statistics

In [3]:
df= pd.read_csv('weather_data.csv')
df

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  Hyderabad             28          60     Sunny
1  02-01-2025  Hyderabad             29          62    Cloudy
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy
5  06-01-2025  Hyderabad             33          59     Rainy
6  07-01-2025   Banglore             34          54     Sunny

In [4]:
df['Temperature_c'].max()

np.int64(34)

In [5]:
df['Temperature_c'].min()

np.int64(28)

In [6]:
df['Temperature_c'].describe()

count     7.000000
mean     31.000000
std       2.160247
min      28.000000
25%      29.500000
50%      31.000000
75%      32.500000
max      34.000000
Name: Temperature_c, dtype: float64

In [7]:
df['Temperature_c'].mean()

np.float64(31.0)

In [8]:
df[df.Temperature_c == df.Temperature_c.max()]

         Date      city  Temperature_c  Humidity_% Condition
6  07-01-2025  Banglore             34          54     Sunny

In [10]:
df.city[df.Temperature_c == df.Temperature_c.max()]

6    Banglore
Name: city, dtype: object

In [11]:
df.count()

Date             7
city             7
Temperature_c    7
Humidity_%       7
Condition        7
dtype: int64

In [13]:
df["city"].nunique()

2

In [14]:
df["city"].value_counts()

city
Hyderabad    5
Banglore     2
Name: count, dtype: int64

# String Cleaning

In [3]:
df

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  Hyderabad             28          60     Sunny
1  02-01-2025  Hyderabad             29          62    Cloudy
2  03-01-2025  Hyderabad             30          58     Rainy
3  04-01-2025   Banglore             31          55     Sunny
4  05-01-2025  Hyderabad             32          63    Cloudy
5  06-01-2025  Hyderabad             33          59     Rainy
6  07-01-2025   Banglore             34          54     Sunny

In [4]:
df["city"]=df["city"].str.lower()
df

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  hyderabad             28          60     Sunny
1  02-01-2025  hyderabad             29          62    Cloudy
2  03-01-2025  hyderabad             30          58     Rainy
3  04-01-2025   banglore             31          55     Sunny
4  05-01-2025  hyderabad             32          63    Cloudy
5  06-01-2025  hyderabad             33          59     Rainy
6  07-01-2025   banglore             34          54     Sunny

In [5]:
df["city"]=df["city"].str.upper()
df

         Date       city  Temperature_c  Humidity_% Condition
0  01-01-2025  HYDERABAD             28          60     Sunny
1  02-01-2025  HYDERABAD             29          62    Cloudy
2  03-01-2025  HYDERABAD             30          58     Rainy
3  04-01-2025   BANGLORE             31          55     Sunny
4  05-01-2025  HYDERABAD             32          63    Cloudy
5  06-01-2025  HYDERABAD             33          59     Rainy
6  07-01-2025   BANGLORE             34          54     Sunny

In [8]:
df["city"]=df["city"].str.replace("HYDERABAD","CHENNAI")
df

         Date      city  Temperature_c  Humidity_% Condition
0  01-01-2025   CHENNAI             28          60     Sunny
1  02-01-2025   CHENNAI             29          62    Cloudy
2  03-01-2025   CHENNAI             30          58     Rainy
3  04-01-2025  BANGLORE             31          55     Sunny
4  05-01-2025   CHENNAI             32          63    Cloudy
5  06-01-2025   CHENNAI             33          59     Rainy
6  07-01-2025  BANGLORE             34          54     Sunny

# Concate Data frames

In [10]:
india_weather=pd.DataFrame({
    "city":["mumbai","banglore","hyderabad"],
    "Temperature":[32,45,35]
})
india_weather

        city  Temperature
0     mumbai           32
1   banglore           45
2  hyderabad           35

In [12]:
US_weather=pd.DataFrame({
    "city":["New york","Chicago","orlando"],
    "Temperature":[32,45,35]
})
US_weather

       city  Temperature
0  New york           32
1   Chicago           45
2   orlando           35

In [13]:
df=pd.concat([india_weather,US_weather])
df

        city  Temperature
0     mumbai           32
1   banglore           45
2  hyderabad           35
0   New york           32
1    Chicago           45
2    orlando           35

In [14]:
df=pd.concat([india_weather,US_weather],axis=1)
df

        city  Temperature      city  Temperature
0     mumbai           32  New york           32
1   banglore           45   Chicago           45
2  hyderabad           35   orlando           35

# Merge DataFrames

In [52]:
temp_df=pd.DataFrame({
    "city":["Banglore","Hyderabad","vijayawada"],
    "Temperature":[49,47,17]
})
temp_df

         city  Temperature
0    Banglore           49
1   Hyderabad           47
2  vijayawada           17

In [53]:
humidity_df=pd.DataFrame({
    "city":["Kerela","Banglore","Hyderabad",],
    "Humidity":[17,7,30]
})
humidity_df

        city  Humidity
0     Kerela        17
1   Banglore         7
2  Hyderabad        30

In [54]:
df=pd.merge(temp_df,humidity_df,on="city",how="outer")
df

         city  Temperature  Humidity
0    Banglore         49.0       7.0
1   Hyderabad         47.0      30.0
2      Kerela          NaN      17.0
3  vijayawada         17.0       NaN

In [55]:
df.isnull()

    city  Temperature  Humidity
0  False        False     False
1  False        False     False
2  False         True     False
3  False        False      True

In [56]:
df.isnull().sum()

city           0
Temperature    1
Humidity       1
dtype: int64

In [57]:
df['Temperature']=df['Temperature'].fillna(df.Temperature.min())

In [58]:
df.isnull()

    city  Temperature  Humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False      True

In [59]:
df

         city  Temperature  Humidity
0    Banglore         49.0       7.0
1   Hyderabad         47.0      30.0
2      Kerela         17.0      17.0
3  vijayawada         17.0       NaN

In [60]:
df['Humidity']=df['Humidity'].fillna(df.Humidity.min())
df.isnull()

    city  Temperature  Humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False

In [61]:
df

         city  Temperature  Humidity
0    Banglore         49.0       7.0
1   Hyderabad         47.0      30.0
2      Kerela         17.0      17.0
3  vijayawada         17.0       7.0

# Covariance and Correlation

# Correlation
   -Direction + How strong the relationships.
   -It is basically a scaled version of covariance.
Range:
   correlation always lies between -1 to +1.
       +1:perfect +tive relationship(Both are same direction)
        0:no relationship
       -1:perfect -tive relationship(Both are opposite direction)

# Covariance
 -covariance tells you wether two variables move together.
      1.positive covariance:If x_variable increases and y_variable increases
      2.negative covariance:If x_variable increases and y_variable decreases
      3.zero covariance:If they move randomly
Note: 
 -covariance only shows direction, NOT strength.

In [5]:
df= pd.read_csv('study_marks.csv')
df

   Study_Hours  Marks
0          2.9   27.0
1          5.8   61.0
2          4.7   45.0
3          4.0   38.0
4          1.8   19.0
5          1.8    8.0
6          1.3    4.0
7          5.3   50.0
8          4.0   35.0
9          4.5   47.0

In [6]:
df.cov()

             Study_Hours       Marks
Study_Hours     2.481000   28.906667
Marks          28.906667  348.711111

In [7]:
df.corr()

             Study_Hours    Marks
Study_Hours      1.00000  0.98277
Marks            0.98277  1.00000

In [18]:
data=({
    "ice_cream":[100,50,20],
    "Temperature":[49,47,17]
})
df=pd.DataFrame(data)

In [21]:
df

   ice_cream  Temperature
0        100           49
1         50           47
2         20           17

In [19]:
df.cov()

               ice_cream  Temperature
ice_cream    1633.333333   593.333333
Temperature   593.333333   321.333333

In [20]:
df.corr()

             ice_cream  Temperature
ice_cream     1.000000     0.818999
Temperature   0.818999     1.000000